In [85]:
import pandas as pd

In [86]:
data = [10,20,30,40]
sr = pd.Series(data, index=['x','y','z','zz'])
print(sr)
print(sr.loc['x'])
print(sr.iloc[0])

x     10
y     20
z     30
zz    40
dtype: int64
10
10

In [87]:
data = {'a': 10, 'b': 20, 'c': 30}
sr = pd.Series(data)
sr

a    10
b    20
c    30
dtype: int64

In [88]:
print(sr['a'])

10

In [89]:
print(sr.loc[['a', 'c']])
print(sr.loc['a'])

a    10
c    30
dtype: int64
10

In [90]:
print(sr.loc[['a', 'c']])
print(sr.loc['a'])
print()

a    10
c    30
dtype: int64
10

In [91]:
print(sr.iloc[1])

20

In [92]:
print(sr['x':'z']) # loc = Last tao nibe
print(sr[0:2]) # iloc = Last er ager ta porjonto nibe

Series([], dtype: int64)
a    10
b    20
dtype: int64

In [93]:
print(sr.get('x'))
print(sr.get('a',50))

None
10

In [94]:
## Dataframe
series1 = pd.Series([10,20,30,40], index=[2, 3,4,5])
series2 = pd.Series(['A','B','C','D'], index=[5, 4, 3, 2])

df = pd.DataFrame({'Numbers': series1, 'Letter':series2})
df

   Numbers Letter
2       10      D
3       20      C
4       30      B
5       40      A

In [95]:
data1 = {
    'Name': ['Rakib','Tamim','Yasin'],
    'Age': [23,44,55],
    'City':['Chit','Dhk','Brishl']
}
df = pd.DataFrame(data1)
print(df)

    Name  Age    City
0  Rakib   23    Chit
1  Tamim   44     Dhk
2  Yasin   55  Brishl

In [96]:
data2 = [
    {'Name': 'Rakib', 'Age': 25, 'City': "Chittagong"},
    {'Name': 'Rakib2', 'Age': 25, 'City': "Chittagong"},
    {'Name': 'Rakib3', 'Age': 25, 'City': "Chittagong"},
    {'Name': 'Rakib3', 'Age': 25, 'City': "Chittagong"},
]
df2 = pd.DataFrame(data2)
df2

     Name  Age        City
0   Rakib   25  Chittagong
1  Rakib2   25  Chittagong
2  Rakib3   25  Chittagong
3  Rakib3   25  Chittagong

In [102]:
print(df2.loc['a'])

KeyError: 'a'

In [40]:
## Dataframa 3 List of dictionary
data3 = [
    {'Name': 'Rakib', 'Age': 25, 'City': "Chittagong"},
    {'Name': 'Rakib2', 'Age': 25, 'City': "Chittagong"},
    {'Name': 'Rakib3', 'Age': 25, 'City': "Chittagong"},
    {'Name': 'Rakib3', 'Age': 25, 'City': "Chittagong"},
]
df3 = pd.DataFrame(data3, index=['a','b','c','d'])
df3

     Name  Age        City
a   Rakib   25  Chittagong
b  Rakib2   25  Chittagong
c  Rakib3   25  Chittagong
d  Rakib3   25  Chittagong

In [41]:
print(df3.loc['a'])

Name         Rakib
Age             25
City    Chittagong
Name: a, dtype: object

In [57]:
print(df3.loc['a':'c'])

     Name  Age        City
a   Rakib   25  Chittagong
b  Rakib2   25  Chittagong
c  Rakib3   25  Chittagong

In [ ]:
print(df2.loc['a':'c'])

In [60]:
## Add a Column
df3['Salary']=[1000,2500,5000,4500]
df3

     Name  Age        City  Salary
a   Rakib   25  Chittagong    1000
b  Rakib2   25  Chittagong    2500
c  Rakib3   25  Chittagong    5000
d  Rakib3   25  Chittagong    4500

In [61]:
df3['Salary']

a    1000
b    2500
c    5000
d    4500
Name: Salary, dtype: int64

In [62]:
df2

     Name  Age        City  Salary
0   Rakib   25  Chittagong    1000
1  Rakib2   25  Chittagong    2500
2  Rakib3   25  Chittagong    5000
3  Rakib3   25  Chittagong    4500

In [63]:
df2.drop('Salary',axis=1)

     Name  Age        City
0   Rakib   25  Chittagong
1  Rakib2   25  Chittagong
2  Rakib3   25  Chittagong
3  Rakib3   25  Chittagong

In [64]:
df2

     Name  Age        City  Salary
0   Rakib   25  Chittagong    1000
1  Rakib2   25  Chittagong    2500
2  Rakib3   25  Chittagong    5000
3  Rakib3   25  Chittagong    4500

In [67]:
df3

     Name  Age        City  Salary
a   Rakib   25  Chittagong    1000
b  Rakib2   25  Chittagong    2500
c  Rakib3   25  Chittagong    5000
d  Rakib3   25  Chittagong    4500

In [71]:
df3.drop('a', axis=0)

     Name  Age        City
b  Rakib2   25  Chittagong
c  Rakib3   25  Chittagong
d  Rakib3   25  Chittagong

In [72]:
df3

     Name  Age        City
a   Rakib   25  Chittagong
b  Rakib2   25  Chittagong
c  Rakib3   25  Chittagong
d  Rakib3   25  Chittagong

In [73]:
df3

     Name  Age        City
a   Rakib   25  Chittagong
b  Rakib2   25  Chittagong
c  Rakib3   25  Chittagong
d  Rakib3   25  Chittagong

In [79]:
df2['Age'] = df2['Age']+10

In [80]:
df2

     Name  Age        City  Salary
0   Rakib   55  Chittagong    1000
1  Rakib2   55  Chittagong    2500
2  Rakib3   55  Chittagong    5000
3  Rakib3   55  Chittagong    4500

In [14]:
#54
df = pd.read_csv('data.csv')

In [15]:
df

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [16]:
df.tail()

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [17]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [18]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [104]:
df.isnull().sum()

Name    0
Age     0
City    0
dtype: int64

In [105]:
df.fillna(0)

    Name  Age    City
0  Rakib   23    Chit
1  Tamim   44     Dhk
2  Yasin   55  Brishl

In [106]:
df['Sales_NOT_NAN'] = df['Sales'].fillna(df['Sales'].mean())
df

KeyError: 'Sales'

In [107]:
df = df.rename(columns={'Sales_NOT_NAN':'New_Sales'})
df

    Name  Age    City
0  Rakib   23    Chit
1  Tamim   44     Dhk
2  Yasin   55  Brishl

In [108]:
df['Value_2x']= df['Value'].apply(lambda x: x*2)

df

KeyError: 'Value'

In [109]:
df = df.sort_values(['Value_2x', 'Sales'], ascending=True)
df

KeyError: 'Value_2x'

In [110]:
df[ (df['Category']=='A') & (df['Region']=='East')]
df

KeyError: 'Category'